In [1]:
import pandas as pd

## TEXT

In [43]:
pd.read_table('my/1.txt')

c:\users\贺青松\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

               email
0   jack@example.com
1  marry@example.com
2   lily@example.com
3    tom@example.com

In [4]:
pd.read_table('my/2.txt')

c:\users\贺青松\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

   name  age             email
0  jack   18  jack@example.com
1  lily   22  lily@example.com
2   tom   21   tom@example.com

In [6]:
pd.read_table('my/3.txt',sep=':',header=None)

c:\users\贺青松\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

      0  1  2  3     4      5                  6
0  root  x  0  0  root  /root          /bin/bash
1   bin  x  2  2   bin   /bin  /usr/sbin/nologin

In [7]:
pd.read_table('my/3.txt',sep=':',names=['name','pwd','uid','gid','local','home','shell'])

c:\users\贺青松\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   name pwd  uid  gid local   home              shell
0  root   x    0    0  root  /root          /bin/bash
1   bin   x    2    2   bin   /bin  /usr/sbin/nologin

## CSV

In [14]:
pd.read_csv('my/4.csv',encoding='utf-8')

    bookname  price
0   endworld   29.9
1   nameless   62.0
2  animation   28.9

In [19]:
pd.read_excel('my/5.xls',header=None)

    0   1     2
0  张三  18  1.68
1  李四  19  1.73
2  王五  17  1.62

## Html

In [21]:
t = pd.read_html('my/6.html')

In [22]:
t[0]

     学号  姓名  年龄        班级
0  1001  张三  22  python04
1  1002  李四  22  python04
2  1003  王五  王五  python04

In [24]:
len(t)

1

## mysql

In [25]:
import pymysql

In [26]:
con = pymysql.connect(host='localhost',user='root',password='',db='shopdb',charset='utf8')

In [28]:
sql = 'select * from users'
data = pd.read_sql(sql,con)
con.close()

In [29]:
data

,id,username,name,password,sex,address,code,phone,email,state,addtime
0,1,admin,管理员2,21232f297a57a5a743894a0e4a801fc3,0,北京市朝阳区大山子007号,100086,13566686868,122794105@qq.com,0,2018-04-07 21:20:08
1,3,zhangsan,张三,ea48576f30be1669971699c09ad05c94,1,北京市三里河蘑菇村102号,10089,12345676890,zhangsan@11.com,1,2018-04-08 11:11:18
2,4,lisi,李四,202cb962ac59075b964b07152d234b70,0,北京市三里河蘑菇村103号,100088,6666666666666,lisi@11.com,2,2018-04-08 11:12:21
3,6,wangwu,王五,e10adc3949ba59abbe56e057f20f883e,0,北京市三里河蘑菇村102号,100086,12345676890,zhangsan@11.com,1,2018-04-08 12:58:58
4,7,along,张小龙,202cb962ac59075b964b07152d234b70,1,北京市海定区上地三街08号嘉华大厦B6-203,100098,12345657890,along@163.com,1,2018-04-10 07:49:45
5,8,caihua,菜花,202cb962ac59075b964b07152d234b70,0,北京市宣武区菜市口100号新龙小区3#-2-608,100036,1234567890,caihua@126.com,1,2018-04-10 07:51:27
6,9,huangsan,黄三,202cb962ac59075b964b07152d234b70,1,北京市昌平区回龙观流星花园A6-3-403,100082,13456767867,huansan@sohu.com,1,2018-04-10 07:53:18
7,10,aidehua,爱德华,202cb962ac59075b964b07152d234b70,1,北京市宣武区菜市口100号新龙小区3#-2-608,100088,12345657890,zhangsan@qq.com,1,2018-04-10 07:54:42
8,11,wangnan,王楠,202cb962ac59075b964b07152d234b70,1,北京市宣武区菜市口100号新龙小区3#-2-608,100088,12345657890,wangnan@180.com,1,2018-04-10 07:55:39
9,12,zhangle,张乐,202cb962ac59075b964b07152d234b70,0,北京市海定区上地三街08号嘉华大厦B6-203,100086,12345657890,zhangle@126.com,1,2018-04-10 07:56:36
10,13,wangsheng,王胜,202cb962ac59075b964b07152d234b70,1,北京市三里河蘑菇村102号,100088,33333333333,wangsheng@163.com,1,2018-04-10 07:57:27
11,14,xusheng,徐盛,202cb962ac59075b964b07152d234b70,1,北京市三里河蘑菇村103号,100088,12345657890,xusheng@122.com,1,2018-04-10 07:58:15
12,15,xumo,许墨,202cb962ac59075b964b07152d234b70,0,北京市三里河蘑菇村103号,100088,12345657890,xumo@136.com,1,2018-04-10 07:59:32
13,16,zhangmo,张墨,202cb962ac59075b964b07152d234b70,1,北京市海定区上地三街08号嘉华大厦B6-203,100086,12345324678,zhangmo@163.com,1,2018-04-10 08:00:21
14,17,zhangjun,张军,202cb962ac59075b964b07152d234b70,0,北京市宣武区菜市口100号新龙小区3#-2-608,100086,12345657890,zhangjun@163.com,1,2018-04-10 08:01:06

## mongodb

In [31]:
import pymongo

In [38]:
client = pymongo.MongoClient('127.0.0.1',27017)

In [39]:
db = 'demo'
table = 'stu'
cursor = client[db][table].find()

In [40]:
data = pd.DataFrame(list(cursor))

In [41]:
data

                        _id   age      name sex
0  5c8dec0bf20fd816dcb001e8  20.0  zhangsan   m
1  5c8dec20f20fd816dcb001e9  22.0      lisi   w
2  5c8dec8df20fd816dcb001ea  20.0    wangwu   w
3  5c8decb9f20fd816dcb001eb  20.0    wangwu   m
4  5c8decccf20fd816dcb001ec  20.0    wangwu   m